# 2 задание
# Ограничение времени
# 7 секунд
# Ограничение памяти
# 256 МБ
# В любом сколько-нибудь приличном редакторе изображений есть функция поворота изображения на ﻿
# 90
# 90﻿ градусов. Что уж тут говорить, такая функция есть и в современных мессенджерах! Вот и вам предстоит реализовать эту функцию. Полноценный фоторедактор не потребуется, остановимся только на функции поворота изображения на ﻿
# 90
# 90﻿ градусов.

# Для простоты будем считать, что изображение представляет из себя матрицу из целых чисел. Вам дана матрица ﻿
# �
# ×
# �
# n×m﻿. Необходимо вывести матрицу, которая будет являться поворотом исходной на ﻿
# 90
# 90﻿ градусов по часовой стрелке.

# Формат входных данных 

# Первая строка содержит два натуральных числа ﻿
# �
# n﻿ и ﻿
# �
# m﻿ ﻿
# (
# 1
# ≤
# �
# ,
# �
# ≤
# 1
# 0
# 3
# )
# (1≤n,m≤10 
# 3
#  )﻿. Следующие ﻿
# �
# n﻿ строк содержат описание матрицы, по ﻿
# �
# m﻿ целых неотрицательных чисел, не превосходящих ﻿
# 1
# 0
# 18
# 10 
# 18
#  ﻿.

# Формат выходных данных 

# Выведите ﻿
# �
# m﻿ строк по ﻿
# �
# n﻿ элементов каждую — повернутую на ﻿
# 90
# 90﻿ градусов матрицу.

# Примеры данных
# Пример 1
# 2 2
# 1 1
# 2 3
# 2 2
# 1 1
# 2 3
# 2 1
# 3 1
# 2 1
# 3 1
# Пример 2
# 2 3
# 1 2 3
# 4 5 6
# 2 3
# 1 2 3
# 4 5 6
# 4 1
# 5 2
# 6 3
# 4 1
# 5 2
# 6 3
# Пример 3
# 1 1
# 69
# 1 1
# 69
# 69
