# I. Лапта
# https://contest.yandex.ru/contest/59542/problems/I/

# При игре в лапту одна команда ловит мяч и пытается осалить
# им бегущего. Игрок другой команды должен, перед тем как
# бежать, ударить мяч в поле. Известно, на какое максимальное
# расстояние он может ударить, а также скорости и начальные
# координаты игроков другой команды. Требуется выбрать
# направление и силу удара так, чтобы минимальное время, 
# которое потребуется другой команде, чтобы поднять мяч с
# земли, было наибольшим. (Пока мяч летит, игроки стоят на местах).