# G. Новый офис плюса
# https://contest.yandex.ru/contest/59542/problems/G/

# Сервис Тындекс.Плюс так быстро растет, что для сотрудников
# и серверов потребовалось потребовалось построить новый офис.
# Участок под застройку представляет из себя клетчатое поле 
# n × m, часть клеток которого пригодна для строительства, а
# часть нет.
# Новый офис должен выглядеть как знак "плюс" какого-то
# целого положительного размера k. Знак "плюс" размера k —
# это такая клетчатая фигура, состоящая из пяти квадратов
# k × k клеток, при этом есть один центральный квадрат, а
# остальные четыре являются его соседями по стороне.
# Новый офис должен быть как можно больше, поэтому необходимо
# найти максимальное k, такое что офис удастся разместить на
# участке под застройку.
# Определите максимальное k. Гарантируется, что он можно
# построить офис хотя бы с k=1.


